; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 340377 2 2 4 7 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph1 - mode
	thermograph3 - mode
	spectrograph0 - mode
	thermograph2 - mode
	Star2 - direction
	Star5 - direction
	GroundStation3 - direction
	Star0 - direction
	Star1 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
)
(:goal (and
	(pointing satellite0 Star0)
	(pointing satellite1 Star5)
	(have_image Planet7 thermograph1)
	(have_image Star8 thermograph2)
	(have_image Planet9 thermograph1)
	(have_image Planet10 thermograph2)
	(have_image Planet11 thermograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (turn_to satellite0 star0 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star0)
   goals met: 1 of 7
4. (turn_to satellite1 groundstation4 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 7
5. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 1 of 7
6. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 1 of 7
7. (turn_to satellite1 star8 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star8)
   goals met: 1 of 7
8. (turn_to satellite0 planet9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet9)
   goals met: 0 of 7
9. (take_image satellite1 star8 instrument2 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 1 of 7
10. (take_image satellite0 planet9 instrument1 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 2 of 7
11. (turn_to satellite0 star0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star0)
   goals met: 3 of 7
12. (turn_to satellite1 star5 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star5)
   goals met: 4 of 7
13. (turn_to satellite0 planet7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet7)
   goals met: 3 of 7
14. (turn_to satellite1 planet10 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet10)
   goals met: 2 of 7
15. (take_image satellite0 planet7 instrument1 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 3 of 7
16. (take_image satellite1 planet10 instrument2 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 4 of 7
17. (turn_to satellite0 star0 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star0)
   goals met: 5 of 7
18. (turn_to satellite1 star5 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star5)
   goals met: 6 of 7
19. (turn_to satellite0 planet11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet11)
   goals met: 5 of 7
20. (take_image satellite0 planet11 instrument1 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 6 of 7
21. (turn_to satellite0 star0 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star0)
   goals met: 7 of 7
